// ConsoleApplication1.cpp : Этот файл содержит функцию "main". Здесь начинается и заканчивается выполнение программы.
//

#include <iostream>

int main()
{
    using namespace std;
    int a, b, i;
    double c, d, k;
    cin >> a;
    cin >> b;
    cin >> c;
    cin >> d;
    cout << a + b << "\n";
    cout << c + d << "\n";
    cout << a + c << "\n";
    cout << b + d << "\n";
    cout << b + c << "\n";
    cout << a + d;
    cout << a - b;
    cout << c - d;
    cout << a - c;
    cout << b - d;
    std::cout << "\n";
    cout << b - c;
    cout << a - d; 
    cout << a * b;
    cout << c * d;
    cout << a * c;
    cout << b * d;
    cout << b * c;
    cout << a * d;
    
}

// Запуск программы: CTRL+F5 или меню "Отладка" > "Запуск без отладки"
// Отладка программы: F5 или меню "Отладка" > "Запустить отладку"

// Советы по началу работы 
//   1. В окне обозревателя решений можно добавлять файлы и управлять ими.
//   2. В окне Team Explorer можно подключиться к системе управления версиями.
//   3. В окне "Выходные данные" можно просматривать выходные данные сборки и другие сообщения.
//   4. В окне "Список ошибок" можно просматривать ошибки.
//   5. Последовательно выберите пункты меню "Проект" > "Добавить новый элемент", чтобы создать файлы кода, или "Проект" > "Добавить существующий элемент", чтобы добавить в проект существующие файлы кода.
//   6. Чтобы снова открыть этот проект позже, выберите пункты меню "Файл" > "Открыть" > "Проект" и выберите SLN-файл.
